In [3]:
# Joshua Perez
# CIS 2532 NET01
# 12/11/2022

In [4]:
import sqlite3

In [5]:
# prior work done to get books.db configured
connection = sqlite3.connect('books.db')

In [6]:
import pandas as pd

In [7]:
pd.options.display.max_columns = 10

In [8]:
pd.read_sql('SELECT last FROM authors ORDER BY last DESC', connection)

     last
0    Wald
1   Quirk
2  Deitel
3  Deitel
4  Deitel

In [9]:
# Book titles in asc order
pd.read_sql('SELECT title FROM titles ORDER BY title ASC', connection)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

In [10]:
cursor = connection.cursor()

In [11]:
'''Couldnt solve 17.1 Part C'''
# queryName = input('Enter specific author: ')
# pd.read_sql("""""SELECT author.first, author.last FROM authors as q1 INNER JOIN authors_ISBN as q2 ON q1.id= q2.id INNER JOIN titles as q3 ON q2.isbn = q3.isbn""", queryName, connection)

# Not sure how to obtain raw string from user input
# Or if I were to Use WHERE last = queryName

'Couldnt solve 17.1 Part C'

In [12]:
# Insert into authors table
cursor = cursor.execute("""INSERT INTO authors (first, last) VALUES ('Joshua', 'Perez')""")

In [13]:
# Show added author
pd.read_sql("""SELECT id, first, last FROM authors""", connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6      Joshua   Perez

In [14]:

insert1 = cursor.execute("""INSERT INTO titles (isbn, title, edition, copyright)VALUES ('0136124386', 'Python How to Program', 9, 2022)""")

In [15]:
insert2 = cursor.execute("""INSERT INTO author_ISBN (id, isbn)VALUES ('6', '0136124386')""")

In [16]:
# Remember my ID for author is 6
pd.read_sql('SELECT id, isbn FROM author_ISBN', connection, index_col = ['id'])

          isbn
id
1   0134289366
2   0134289366
5   0134289366
1   0135404673
2   0135404673
1   0132151006
2   0132151006
3   0132151006
1   0134743350
2   0134743350
1   0133976890
2   0133976890
1   0133406954
2   0133406954
3   0133406954
1   0134601548
2   0134601548
1   0136151574
2   0136151574
4   0136151574
1   0134448235
2   0134448235
1   0134444302
2   0134444302
6   0136124386

In [17]:
# Python How to Program with isbn
pd.read_sql ('SELECT isbn, title FROM titles', connection)

          isbn                             title
0   0135404673     Intro to Python for CS and DS
1   0132151006     Internet & WWW How to Program
2   0134743350               Java How to Program
3   0133976890                  C How to Program
4   0133406954  Visual Basic 2012 How to Program
5   0134601548          Visual C# How to Program
6   0136151574         Visual C++ How to Program
7   0134448235                C++ How to Program
8   0134444302            Android How to Program
9   0134289366         Android 6 for Programmers
10  0136124386             Python How to Program